/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_ft.c                                            :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyunjiki <hyunjiki@student.42gyeongsa      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/15 06:23:27 by hyunjiki          #+#    #+#             */
/*   Updated: 2024/01/23 17:41:15 by hyunjiki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include <stdio.h>

void	ft_ft(int *nbr)
{
	*nbr = 42;
}

/*int main(void)
{
    int nbr = 0;
    ft_ft(&nbr); // nbr의 주소값을 ft_ft 함수에 입력하여 nbr이 가리키는 42의 값을 가져옴
    printf("%d\n", nbr);
    return 0;
}*/