/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   test.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyunjiki <hyunjiki@student.42gyeongsa      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/02/04 05:41:23 by hyunjiki          #+#    #+#             */
/*   Updated: 2024/02/04 16:49:24 by hyunjiki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <stdio.h>

int	main()
{
	char *p = "123456";
	printf("p: %p\n", p);		// 0x402004
	printf("&p: %p\n", &p);		// 0x7ffed94116f8
	printf("*p: %c\n", *p);		// 1
	printf("p[0]: %c\n", p[0]); 	// p가 가르키고 있는 것의 0번째 값 == *p -> 1
	printf("*(p+1): %c\n", *(p+1));	// hint: 0x402004 주소가 가리키는 것은 "123456" 전체가 아니다 -> 1 byte(char size만큼) 하나다 -> 2
	printf("*(++p): %c\n", *(++p)); // 2
	printf("*p: %c\n", *p);		// 2
}
