/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: kyouhele <kyouhele@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/16 15:41:47 by kyouhele          #+#    #+#             */
/*   Updated: 2024/01/17 21:43:25 by hyunjiki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>	// write 함수 사용을 위해 <unistd.h> 사용

void	ft_putchar(char c)	// c를 가진 ft_putchar 파일을 void형으로 반환
{
	write(1, &c, 1);	// c의 주소값을 화면에 출력
}
