/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_swap.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hyunjiki <hyunjiki@student.42gyeongsa      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/01/23 17:54:43 by hyunjiki          #+#    #+#             */
/*   Updated: 2024/01/23 20:40:45 by hyunjiki         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

void	ft_swap(int *a, int *b)
{
	int	temp;

	temp = 0;
	temp = *a;
	*a = *b;
	*b = temp;
}
/*int main(void)
{
        int a = 2, b = 3;
        ft_swap(&a, &b);    // ft_swap 함수에에 a,b의 주소값을 사용
        printf("a = %d, b = %d\n", a, b); // a,b의 주소값을 사용하여 a,b가 가리키는 값을 스왑
        return 0;
}*/
